{
  "posts": [


    {
      "title": "The Future of the Classroom: zSpace Looks to Transform Education With Their New Platform, an Interview with CTO David Chavez",
      "author": "Will Mason",
      "date": "01/14/15",
      "imageURL": "blogphotos/zspace.jpg",
      "paragraphs": [
        "In the wake of this year's CES, one thing was made completely clear: 2015 will be the year that VR and consumers finally become fully acquainted. Of course, the early focus for VR has been on the gaming scene, but those who are following the industry are aware of the power it has to transform our lives in many other ways, including productivity and our education.",
        "One of the company's working in that particular realm is zSpace, who have developed a revolutionary desktop VR solution specifically crafted for the classroom. The company has developed a platform that they believe will completely transform the way our children learn in the classroom. By making learning experiences that are as engaging as they are immersive, zSpace hopes to get students more interested in continuing to learn about the subjects they are studying, which they believe will translate to a greater depth in student understanding.",
        "I sat down with the company's CTO, David Chavez, after CES to talk about the future of VR Education. We had an in-depth discussion about what's to come, and about what zSpace is looking to accomplish with their impressive new platform. See below for our complete conversation:",
        "Will Mason: How do you see VR affecting our relationship with computers? How is that change transformative?",
        "David Chavez: The fundamental value of VR is tied to the design and performance of the human visual perceptive system; our abilities of spatial cognition are enabled by amazingly complex neurobiological infrastructure. It's obvious that our physical abilities to interact with the spatial environment are closely tied to our visual system—a significant percentage of our active hours include using our hands under guidance of the visual system.   The most natural way we interact with our environment, which we do all day long, is to reach in and directly interact.",
        "Short of VR, our interactions with computers are nothing close to what could be considered natural. Given millions of years of evolution to perfect our perception of our volumetric world (consider the fact that essentially all complex life has exactly two eyes), why do we stare at 2D displays and indirectly wiggle a mouse?   Much of what we see on 2D screens is perfectly suitable for 2D; however, much has been adapted, projected, reduced in information content, or otherwise artificially represented in a way that can be interpreted on a 2D display.",
        "We've just come to accept the limitations of today's computer interaction models. We expect flat representations. We'd never think to reach a hand into a computer screen to grab, move, point, or rotate.   That's all fine, but it does not take full advantage of our abilities to interact with information.",
        "A VR system, if delivered with sufficient fidelity, allows users to take advantage of their spatial cognitive abilities in a way that is strikingly familiar, comfortable, and powerful. Such an environment is also virtual. In the virtual world, only our imagination limits the kinds of things that can happen. The application of computing technology, exponentially increasing in capabilities, can in a VR system be applied to take advantage of our abilities in a way that few people have experienced.",
        "Will: What makes VR so important?",
        "Dave: Virtual reality opens doors that would otherwise be impractical or impossible. You can explore complex or difficult concepts in a very natural, comfortable environment, visit locations that are otherwise inaccessible, examine endless biological objects or systems, as if they were floating in space, and view and interact with systems whose scales range from the atomic to astronomical. Beyond that it is also great for creation, you can invent and prototype endlessly, without the associated materials costs, experiment, practice, and train with impractical or dangerous materials or scenarios, and collaborate in ways that up to now have been limited to science fiction. It's all extremely exciting.",
        "Will: Where does the future of education fit within the VR space? What makes this medium so perfect for educational purposes?",
        "Dave: For the reasons I discussed before, the range of potential value of VR extends to a wide range of markets such as simulation and training, education, product design, healthcare, e-commerce, entertainment, and gaming. Common throughout the set of applications in those markets is the element of discovery; zSpace has leveraged the element of discovery in its first major target market of education. The obvious link between discovery and learning makes the classroom an ideal setting to take advantage of an immersive platform. Applications that help convey the concepts of Newtonian mechanics, biology, anatomy, electricity, and electromagnetism have been met with praise and excitement from students, parents, and administration.",
        "Teachers report two key factors that influence their students' ability to learn with zSpace. First, students are more prepared for classroom teaching after being introduced to concepts in zSpace as the exploration and immersion lead them to ask questions about the topic; and second, the hands-on experience creates opportunities beyond what was possible with current tools, resulting in student excitement and engagement.",
        "The interactive environment allows students to explore and discover in a way that textbooks do not.",
        "Students have reported many learning impacts after their classroom experiences with zSpace. For example, they can learn faster by interacting with 3D objects because they don't have to imagine how things look or are arranged, but they can see for themselves. They have also been able to learn more effectively as a result of being interested and able to use their intuition. Further, they can do things that are difficult or impossible in real life. For example, dissecting a beating heart, or instantly setting up (or cleaning up) a complex Rube Goldberg machine. All enabled by using our system."
      ]
    },
    

     {
      "title": "Samsung Gear VR Launch Titles, Part 1: Games",
       "author": "Matthew Tunrdrup",
       "date": "011/14/14",
       "videoURL": "blogphotos/gear.ogv",
       "paragraphs": [
       "When Samsung announced the Gear VR was going to be released in early December, one of the first questions on many people's minds was: ‘so what are we going to be able to play?' Thankfully that, too, was revealed to us at the developers conference. Here is a preview of what all is to come:",
       "TEMPLE RUN VR",
       "Porting the incredibly popular Temple Run mobile game to VR is an entirely new experience. Among the more “high profile” launch titles, Temple Run for Gear VR looks incredibly slick. For those unfamiliar with the original title, you are an anthologist with excellent stamina trying to outrun a giant ape-like creature and escape the Temple. Aside from its gorgeous visuals, the low user input, high adrenaline output nature of the title makes it especially appealing. This should definitely be one of the early benchmark mobile VR experiences.",
       "JAME's LEGACY: THE PROLOGUE",
       "When Samsung debuted the Gear VR in September, James's Legacy: The Prologue was the only game they showed actual footage of. Echoing Lucky's Tale the game is set to be a third person puzzle adventure that takes users to a number of colorful planets. We don't know much about the game, produced by Nestoss, but from the game play footage (courtesy of VRFocus) it looks like it will be a fun, and beautiful experience.",
       "OMEGA AGENT",
       "In this Gear VR exclusive title, you are the Omega Agent, an agent on a mission to fly his jetpack all around a gorgeously rendered city. Fireproof Games, creators of the famous The Room series of mobile games, developed the game. The game is “set on a remote island training facility for cold-war super-spies, the player straps on a prototype nuclear-powered jetpack and blasts around a city filled with breath-taking events and daring missions.” Fireproof, you had me at “jetpack,” I'm pumped to get my Bond on.",
       "ANSHAR WARS",
       "In this game, produced by Ozwe, the player controls a “spaceship from a third person perspective and must defend their mothership from attack by enemy forces.” Space battles in VR? Sign me up please! This game has also received a lot of compliments from influencers like Cymatic Bruce, who called the game “brilliant.” If this game plays half as well as it looks it should be a huge success, it takes the old school fun of arcade games and puts it in a whole new medium.",
       "DENA'S PROTOCOL ZERO",
       "Not much is known about this game, created by DENA/Mobage who were behind the excellent mobile game, The Drowning. Tech Sources reports the experience “treats the headset as a night vision, X-ray vision, and thermal vision device.” Interested to see what this is, but if its anything like The Drowning it should be excellent."

       ]
     },



      {
      "title": "Epic Games Deliver Unreal Experiences in VR, UE4 Positioned to be Premiere Platform for VR Development",
      "author": "Will Mason",
      "date": "01/14/2015",
      "imageURL": "blogphotos/unreal.jpg",
      "paragraphs": [
        "Here at the Upload Journal, we talk a lot about Virtual Reality's uses beyond gaming. The potentials for this platform are truly limited only by our imaginations. This all being said, it is undeniable that games will play a massive role (if perhaps not the most massive role) in helping VR take off as a transformative new medium. Even Palmer Luckey himself has said that games are going to be what the industry is initially built on. It is clear that delivering incredible gaming experiences is a priority, and after going through the Crescent Bay demo it was clear that Oculus wanted to highlight one development platform for VR gaming, the Unreal Engine.",
        "Epic Games first showcased the Unreal Engine all the way back in 1998, and since then the platform has blossomed into one of the premier creation tools for first person gaming, which is why it is such a perfect marriage for VR. Epic Games has also been known to push the envelope before with new gaming platforms, like it did with Infinity Blade on mobile, a game which redefined mobile gaming and proved console-quality graphics were possible on a smartphone. With Infinity Blade now on it's third iteration, and VR on the ever-closing horizon, Unreal Engine 4 (UE4) and Epic Games are getting serious about VR.",
        "Unreal Engine 4 has been on the VR train for about two years now, it seems like yesterday at this point but it was all the way back in 2013 when we first saw Jimmy Fallon trying out the Epic Citadel demo in January which was running on UE3. Unreal followed this up with its Elemental VR demo at E3 in June which showed off the power of UE4 in VR for the first time, picking up a bunch of awards along the way.  Since then a lot has happened with the development of games on the platform, including Oculus embracing the engine as their preferred one for internal development. While no official announcement has been made to this necessarily from the Oculus brass, actions speak louder than words. At both CES and Oculus Connect, UE4 was used to run most, if not all of the demos, including even adding a UE4 splash screen in between certain demos. Most notably, the showcase, final demo shown at both events was “Showdown” (or as Epic calls it, “Car Flip”) which may be the most polished looking demo out there right now, providing gamers and enthusiasts a glimpse of what AAA titles might look like on the Rift.",
        "Speaking of potential AAA titles, a number of other “mainstream” VR experiences are using the platform now. Eve: Valkyrie, which recently made the switch from Unity to UE4, is one of those titles. Lead game developer Chris Smith told Polygon, “it's just a great engine that renders a great game. It allows me to express what I need to express on a tool I'm familiar with.” Smith continued further, likening moving the game from Unity to UE4 to “turning it into a real boy.” Another major upcoming VR game, Adr1ft, also made the switch from Unity to UE4. It's clear that as we move towards true consumer VR UE4 is going help lead the way, and that is a good thing.",
        "UE4 has long been one of the, if not the best, platforms for developing first person perspective experiences so it really makes sense that as we are transporting ourselves into the virtual world it is the platform a lot of developers are leaning on. Major studios like Kite & Lightning, Untold Games, and White Lotus Interactive are all on board with the engine and creating VR experiences. Oculus is already showcasing them as the platform for their pre-CV1 prototype, the Crescent Bay. So what are some of the things that make UE4 so great for developers? First of all, UE4 looks great right out of the box its beautiful and easy to use and makes some pretty impressive looking games. Second, it is open source software, which is huge during such a nascent time in the VR industry where things seemingly change every week. Speaking of that, it comes with Oculus support directly out of the box, without the use of any plugins. For the programming portion, there is some great visual programming the platform offers with the blueprint system. All this with a cheap monthly subscription of only $19, and you have a great platform for developers to start building incredibly detailed VR experiences.",
        "2015 is going to be a great year for VR, and I fully expect we will see quite a lot of the spinning UE4 logo in our HMDs over the course of it."
      ]
    },

        {
      "title": "Magic Leap Collaborating with Avatar and Lord of the Rings Special Effects Team, Weta Workshop, on FPS for the Device",
      "author": "Will Mason",
      "date": "02/18/15",
      "imageURL": "blogphotos/magic-leap.jpg",
      "paragraphs": [
        "When a sleeping giant snores, it can be heard across the planes. The same can be said for the ever-mysterious startup Magic Leap. Since being thrust into the public consciousness in October with a massive $542M funding round, Magic Leap has continued to operate largely in the shadows, yet clues to their plans continue to leak out across the internet; the latest of which seems to give a little more insight as to what we might expect from the device.",
        "A recently posted job description by Magic Leap on Gamasutra, says the company is “looking for the world's best level designers” to join the team in collaboration with Weta Workshop to help design levels for a “truly next-generation Dr. Grordbort's first person shooter.” According to the job description the game will be “a robot-disintegrating science fiction experience.” This game may well be one of, if not the, premiere launch titles for the new platform (or it may be another “red herring,” but more on that in a second).",
        "Weta Workshop, based in New Zealand, is the special effects house behind films like Avatar and all of the Lord of the Rings movies. They also produce a line of replica ray guns “made by” adventurer Dr. Grordbort which may give us a clue as to what this game's look might be. It's clear that the guys at Weta Workshop are impressed by the Magic Leap as a platform, Richard Taylor, Weta's Co-Founder (who is also a member of the board of directors at Magic Leap) described the product as “a rocketship for the mind.”",
        "This is not the first time that Weta Workshop and Magic Leap have collaborated either, the two worked on a project together called “The Hour Blue” back in 2011. The project, however, like much of Magic Leap's early marketing seems to be a bit of a psychedelic joke. In fact, in an interview with the South Florida Business Journal Magic Leap CEO, Rony Abovitz, called the app “a bit of a red herring.” In the same interview, Abovitz also described the reasons behind their relationship with Weta Workshop, saying that “not many people are as creatively open,” and “they are in New Zealand, they are… off the grid in a way – and we want that.”  Beyond secrecy, they are also one of the best special effects studios in the business, having taken home over 30 awards, including 5 Oscars.",
        "At the very least, we can take away from this that the device will, in fact, have both a consumer focus and will be involved in the gaming space right off the bat. The device itself, however, still remains shrouded in mystery. Most of the information available to us suggests that the device is essentially some form of perfected augmented reality that they are calling “Cinematic Reality™.” Abovitz offers some clarification (in his own enigmatic way) as to why they have chosen to go with a new term, rather than embracing the established ones:",
        "“Those are old terms – virtual reality, augmented reality. They have legacy behind them. They are associated with things that didn't necessarily deliver on a promise or live up to expectations. We have the term cinematic reality because we are disassociated with those things. … When you see this, you will see that this is computing for the next 30 or 40 years. To go farther and deeper than we're going, you would be changing what it means to be human.”",
        "I know I am not alone when I say that I'm ready for them to show the device already, a number of sources I have talked to in the company have expressed similar sentiments. But we have all waited this long, we can wait a little bit longer. Until now, our imaginations can continue to run wild about the device one investor called, “so badass you cannot believe it,” and I think thats exactly what Magic Leap is hoping we do."



      ]
    },


     {
      "title": "Oculus shows off the Crescent Bay at CES 2015, and its better than you can imagine",
      "author": "Will Mason",
      "date": "01/06/15",
      "imageURL": "blogphotos/crescent.jpg",
      "paragraphs": [
        "The International CES is now officially underway, so of course I woke up early and made a bee-line for the Oculus booth, which is thoroughly impressive in and of itself. A two story well appointed behemoth, it's clear that Oculus is a centerpiece at this year's CES. But enough about the booth, lets get right to the thing we have all been so excited to see, the new Crescent Bay.",
        "This was my first time getting the chance to try on the new prototype, which many are speculating is the last version before CV1, so I was obviously super pumped to try it on and I will tell you right now, I hadn't even prepared myself for the level of epicness that I witnessed within the demo. It was seriously that good, and if there are any skeptics still out there, be ready to have your skepticism completely washed away.",
        "I walked into the soundproofed booth and the first thing I noticed was the lack of any chairs in the room, right away they wanted to make sure this was a standing experience. My demo leader asked me a couple of questions and took my glasses then prepared to hand me the most life changing piece of hardware I have ever had the pleasure of trying. After a brief adjustment or two the first demo fired up but not before I was told five words that would utterly transform the VR experience for me, “go ahead and walk around.”",
        "The first demo placed me in a futuristic looking boiler room, as I walked around I found quickly that the padded walls provided more than just excellent sound proofing. The positional tracking on the Crescent Bay is massively improved over the DK2 and it really showed during this demo, true to what I was told, I was able to maneuver rather freely within the environment. How's the display, you ask? Un-be-fucking-leavable. Seriously, this thing was so crisp and clear that in the 10-15 minutes (it was so immersive I completely lost track of time) of demos I tried it provoked more audible “Holy shit's!” than the South Park episode with the shit counter. Seriously, I think the demoer was enjoying watching me as much as I was enjoying demoing, but I digress.",
        "The Crescent Bay has completely solved the screen door effect that plagued the DK1 and to a lesser degree the DK2. The display was also far more crisp than the DK2, I have found that with my eyesight sometimes in the DK2 objects would occasionally appear fairly blurry, this was definitely not the case with the Crescent Bay. None of the demoes that I tried really had any text in them, so I can't comment yet on the readability of it, however there was one of the demoes that had some sheet music on a stand that I walked over and leaned in on and it looked crystal clear up close, although before I approached it, it did appear slightly pixelated, but I think that may have been a rendering glitch.",
        "Each of the 18 demos that I was ran through showed off a different aspect of the technology and how it could be applied across multiple genres and mediums. While there was no 360-degree video demo per se, there was a hilarious demo with two robot arms that got into a fight with magic wands, it was very reminiscent of the original Pixar lamp short. The demo really showed off the narrative power of videos in VR as the fight commenced and the robots shifted to either side of the peripheral vision firing colorful, Harry Potter-esque bolts of magic at each other. As I shifted directions to track the bolts I found myself physically reacting and dodging them as they came towards my face, it was one of the first times I have had a truly subconscious physical reaction to VR and was definitely one of my first moments of true presence. There was a similar effect achieved for me during the bullet time demo, Showdown – which was shown at Connect last year – as the 3D was so great that I really felt like I was moving in slow motion through a firefight with a giant robot, I took the opportunity to practice my Matrix moves as I dipped and dodged to avoid the bullets and shrapnel.",
        "Speaking of the 3D, I am not sure what it was, perhaps just optimization of the experiences, but it felt massively improved over the DK2. This was especially true during the two demos that I tried that involved a T-Rex. The first was simply a highly detailed model that growled at you as you looked around it, but at that scale the sense of depth was truly impressive. The second placed me in a hallway, as I looked around I could sense something was about to happen and when it did… whoa nelly. A loud roar, heard incredibly clearly though the surprisingly impressive built in headphones, caused me to whip around to see a T-Rex bum rushing me, and as it got close and opened its mouth to take a bite, I felt myself putting my hands up, the only thing was missing was foul breath in my face but I can live without that.",
        "Another demo placed me in a familiar top of the being built skyscraper situation, but this one was far more clear than any other I have tried. One of the more hilarious highlights of this particular demo was a billboard featuring Palmer himself placed directly behind the player in the futuristic cityscape. My one gripe, and it's minor, is that I was a little disappointed I didn't go careening down to the concrete below when I stepped off the edge, although I did get a little bit of a weird feeling in the pit of my stomach as I peered down. Unlike the Sightline demo, this scene was at night, which really added to the beauty of the city scene, as the colors of the lights really popped.",
        "Speaking of colors perhaps the best demo for that was this one that was similar to the art style of Windracers. All it was was you sitting around a fire with a couple of cute forest animals, and it was extremely simple graphically but the colors all popped quite well. It did an excellent job of demonstrating how you don't need the most photorealistic graphics to create an immersive and enjoyable scene.",
        "By the end of the last demo, my cheeks hurt because I had been smiling so much in pure amazement and joy from the experience. It reminded me of the first time I tried VR, firing up a Titans of Space demo and sheading a tear out of pure amazement that this, something I had dreamed of my entire life, was actually going to be realized. Simply put, the Crescent Bay was like experiencing VR for the first time all over again.",
        "Make sure to stay tuned to Upload's coverage of CES, we will be bringing a 180-degree 3D camera out on the show floor, thanks to our friends over at Lucid Cam, so we should have some pretty great content to show all of you soon. Until then, stay Rifty."
      ]
    }



 
  ]
}