{
  "posts": [


      {
      "title": "The Omni belongs in the gym, not the living room",
      "author": "Will Mason",
      "date": "01/10/2015",
      "paragraphs": [
        "There was a lot of hype surrounding the debut of the Virtuix Omni at this year’s International CES. Ever since the company premiered on Kickstarter, there has been a portion of the VR community who have questioned its potential for success. There are a number of reasons for this, it’s large, weighing in at about 160lbs, with a footprint of 47”x42”x27” meaning that if you don’t have a room dedicated to it, one might run into issues with space. Secondly, many have pointed out that you need to hang the Rift cables from the ceiling, to prevent you from tripping all over yourself. Both of these are issues that make this device not one that is suited for the mass gaming market… and that is totally ok.",
        "The Omni is a fantastic device. It is smooth and accurate, as well as entertaining, but Jan – the CEO of Virtiux, himself admits “it’s not for everybody.” Where it does fit, however, is as a “home exercise device,” a product category that is obviously quite successful. So, changing one’s perspective on the use cases for this product, it can be easy to see why the Omni could help revolutionize the way we run at home.",
        "Currently, the Omni is available for pre-order for $499, which is 55% cheaper than the cost of your average treadmill. Combine that with your Oculus and the cost is pretty comparable, and is certainly cheaper than your higher end treadmill models, which run closer to $1500. Meaning the Omni/Rift combo will run about 2/3rds of the cost of a well appointed treadmill, as well as coming with a number of additional benefits. It’s quite the trip being able to run and gun in a virtual world while actually running. Running through the demo for five minutes or so, I worked up a bit of a sweat and needed to towel off. I found that I was so immersed in the experience that I didn’t even notice I was working out until I took off the Rift. For people who love to run distances, this could be a big boon. Watching SportsCenter in a home gym can only entertain you for so long, a game gives you constant stimulation, which really enhances the exercise experience and pushes you to keep going.",
        "Beyond gamifying the running experience, the Omni actually improves the running experience physically as well; especially when compared to a traditional treadmill. I say this for a couple of reasons, first traditional treadmills have you running with the belt, this provides an additional amount of force that isn’t present in a traditional running setting. This is why when you run on a treadmill you might be able to run faster than you can when you go for a run around the block, especially at distances over two miles.",
        "Second, traditional treadmills can often lead to joint pain, especially in those who do not exercise on them often (which can lead to people exercising less because they then associate that pain with exercise and seek to avoid it). According to Livestrong.com, this is because “exercising on treadmills offers different approaches to joint biomechanics than walking or running on a track, issues with joint pain from treadmills are frequently encountered by both first-time and long-time users of treadmills.” Simply put, you run differently on a treadmill than you do on a track or sidewalk and it stresses your muscles and joints. With the Omni, there is very low resistance, the surface is extremely slick, especially with the specialty shoes for the system. This presents one with a slight learning curve, as I found out when I about ate shit trying to get in for the first time, but once I got the hang of it I found running in the device to be quite comfortable. It almost feels like running on air when you are in the Rift, the feeling is very hard to grasp at the start; that being said it was something I felt I could continue to run in for much longer than I would run on a traditional treadmill.",
        "A third advantage the treadmill has is the new sensors, which are attached to the laces of the shoes, allowing for your motions to be tracked even while you are not touching the surface of the device. This opens the door for potential light plyometrics to be added into one’s workout within the device. And with as much wearable fitness tech as I saw on the show floor at CES, it will be interesting to see if any integration with that sort of technology becomes a part of the Omni’s plan.",
        "This all being said, there still is a problem that remains in that the Rift has a tendency to get a bit gross with sweat and can occasionally fog up. This however seems like a solvable problem. We have seen covers like Eric Greenbaum’s About Face and the fogging issue is not too different than a fogging issue while running with regular glasses. It is an inconvenience but not one that is a game-breaker and is certainly an inconvenience that is more than balanced out by the experience of exercising and gaming simultaneously. Additionally, if you use an anti-fogging spray, similar to the ones used for scuba diving, it can help alleviate any fogging issues within the Rift.",
        "So, rather than thinking of the Omni as an oversized, pricey piece of input hardware for gaming, it is more helpful to view it as a device specifically for the home exercise market, and one that is quite competitive in both price and size. The global treadmill market is a huge one, with over $1.12 billion in sales in 2011. If Omni positions itself in this segment, they could become a big player in the field once consumer VR takes off."
      ]
    },

    {
      "title": "Oovoo plans to bring their 120 million users to VR, exclusive report",
      "author": "Will Mason",
      "date": "01/08/15",
      "paragraphs": [
        "Oovoo, one of the leading social media companies in the world, is getting into the VR space, according to JP Nauseef the company’s managing director. In an exclusive interview with Upload, Nauseef and CMO Chris Wire revealed the company has plans to integrate its platform with Oculus VR.",
        "“The universe of possibilities is virtually endless,” said Nauseef, “we are picking the applications very carefully but integration with Oculus is one of those.” When pressed for further details Nauseef remained coy, “we want to save some surprises for later.” However, he promised that further announcements in the next two quarters and hinted at the mobile world conference and Barcelona being the place where the platform will be revealed. “This is the year, it’s going to be exciting.”",
        "This is all obviously extremely exciting for VR as it has the potential to be a revolutionary social platform. With 120 million registered users Oovoo is one of Skype’s top competitors and is one of the top social media apps in the world. The potential of this marriage is obvious as it would expose the massive, established user base to virtual reality.",
        "This news all comes at the same time as Oovoo announced its intelligent video platform powered by  FaceShift technology. At the booth the company was demoing this new tech in an impressive way, stay tuned for that video later."
      ]
    },

     {
      "title": "Oculus shows off the Crescent Bay at CES 2015, and it’s better than you can imagine",
      "author": "Will Mason",
      "date": "01/06/15",
      "paragraphs": [
        "The International CES is now officially underway, so of course I woke up early and made a bee-line for the Oculus booth, which is thoroughly impressive in and of itself. A two story well appointed behemoth, it’s clear that Oculus is a centerpiece at this year’s CES. But enough about the booth, lets get right to the thing we have all been so excited to see, the new Crescent Bay.",
        "This was my first time getting the chance to try on the new prototype, which many are speculating is the last version before CV1, so I was obviously super pumped to try it on and I will tell you right now, I hadn’t even prepared myself for the level of epicness that I witnessed within the demo. It was seriously that good, and if there are any skeptics still out there, be ready to have your skepticism completely washed away.",
        "I walked into the soundproofed booth and the first thing I noticed was the lack of any chairs in the room, right away they wanted to make sure this was a standing experience. My demo leader asked me a couple of questions and took my glasses then prepared to hand me the most life changing piece of hardware I have ever had the pleasure of trying. After a brief adjustment or two the first demo fired up but not before I was told five words that would utterly transform the VR experience for me, “go ahead and walk around.”",
        "The first demo placed me in a futuristic looking boiler room, as I walked around I found quickly that the padded walls provided more than just excellent sound proofing. The positional tracking on the Crescent Bay is massively improved over the DK2 and it really showed during this demo, true to what I was told, I was able to maneuver rather freely within the environment. How’s the display, you ask? Un-be-fucking-leavable. Seriously, this thing was so crisp and clear that in the 10-15 minutes (it was so immersive I completely lost track of time) of demos I tried it provoked more audible “Holy shit’s!” than the South Park episode with the shit counter. Seriously, I think the demoer was enjoying watching me as much as I was enjoying demoing, but I digress.",
        "The Crescent Bay has completely solved the screen door effect that plagued the DK1 and to a lesser degree the DK2. The display was also far more crisp than the DK2, I have found that with my eyesight sometimes in the DK2 objects would occasionally appear fairly blurry, this was definitely not the case with the Crescent Bay. None of the demoes that I tried really had any text in them, so I can’t comment yet on the readability of it, however there was one of the demoes that had some sheet music on a stand that I walked over and leaned in on and it looked crystal clear up close, although before I approached it, it did appear slightly pixelated, but I think that may have been a rendering glitch.",
        "Each of the 18 demos that I was ran through showed off a different aspect of the technology and how it could be applied across multiple genres and mediums. While there was no 360-degree video demo per se, there was a hilarious demo with two robot arms that got into a fight with magic wands, it was very reminiscent of the original Pixar lamp short. The demo really showed off the narrative power of videos in VR as the fight commenced and the robots shifted to either side of the peripheral vision firing colorful, Harry Potter-esque bolts of magic at each other. As I shifted directions to track the bolts I found myself physically reacting and dodging them as they came towards my face, it was one of the first times I have had a truly subconscious physical reaction to VR and was definitely one of my first moments of true presence. There was a similar effect achieved for me during the bullet time demo, Showdown – which was shown at Connect last year – as the 3D was so great that I really felt like I was moving in slow motion through a firefight with a giant robot, I took the opportunity to practice my Matrix moves as I dipped and dodged to avoid the bullets and shrapnel.",
        "Speaking of the 3D, I am not sure what it was, perhaps just optimization of the experiences, but it felt massively improved over the DK2. This was especially true during the two demos that I tried that involved a T-Rex. The first was simply a highly detailed model that growled at you as you looked around it, but at that scale the sense of depth was truly impressive. The second placed me in a hallway, as I looked around I could sense something was about to happen and when it did… whoa nelly. A loud roar, heard incredibly clearly though the surprisingly impressive built in headphones, caused me to whip around to see a T-Rex bum rushing me, and as it got close and opened its mouth to take a bite, I felt myself putting my hands up, the only thing was missing was foul breath in my face but I can live without that.",
        "Another demo placed me in a familiar top of the being built skyscraper situation, but this one was far more clear than any other I have tried. One of the more hilarious highlights of this particular demo was a billboard featuring Palmer himself placed directly behind the player in the futuristic cityscape. My one gripe, and it’s minor, is that I was a little disappointed I didn’t go careening down to the concrete below when I stepped off the edge, although I did get a little bit of a weird feeling in the pit of my stomach as I peered down. Unlike the Sightline demo, this scene was at night, which really added to the beauty of the city scene, as the colors of the lights really popped.",
        "Speaking of colors perhaps the best demo for that was this one that was similar to the art style of Windracers. All it was was you sitting around a fire with a couple of cute forest animals, and it was extremely simple graphically but the colors all popped quite well. It did an excellent job of demonstrating how you don’t need the most photorealistic graphics to create an immersive and enjoyable scene.",
        "By the end of the last demo, my cheeks hurt because I had been smiling so much in pure amazement and joy from the experience. It reminded me of the first time I tried VR, firing up a Titans of Space demo and sheading a tear out of pure amazement that this, something I had dreamed of my entire life, was actually going to be realized. Simply put, the Crescent Bay was like experiencing VR for the first time all over again.",
        "Make sure to stay tuned to Upload’s coverage of CES, we will be bringing a 180-degree 3D camera out on the show floor, thanks to our friends over at Lucid Cam, so we should have some pretty great content to show all of you soon. Until then, stay Rifty."
      ]
    },

     {
      "title": "Samsung debuts milkvrat CES announces partnerships with the nba and walking dead producer david alpert",
      "author": "Will Mason",
      "date": "01/06/15",
      "paragraphs": [
        "CES has barely gotten under way, and already the VR announcements are coming in. During today’s press conference, Samsung announced MilkVR, an immersive video platform for the GearVR, available today from the Oculus Share store.",
        "MilkVR offers a daily stream of 360-degree videos that, according to Tim Baxter, president and COO of Samsung North America, “will make the GearVR a must have.” The app will launch with 30 new titles and promises to deliver new content daily, “from music and sports to action and lifestyle so there’s always something fresh.” This could very well be the long awaited “Youtube of VR content” that we have been waiting for and as Baxter put it brings consumer VR to “more than within our reach.”",
        "One of the first major experiences coming to MilkVR is a “mystery suspense experience” from Walking Dead executive producer, David Alpert and his studio Skybound Entertainment. Alpert was extremely enthusiastic about the opportunity to explore the new medium saying, “VR allows us to get really creative.” The experience, which will be released later this year, comes in short episodes and will be available exclusively on the MilkVR app. According to Alpert, the new medium “allows story tellers to push the boundaries in finding new ways of connecting with the audience.” Baxter posed the question to Alpert that we were all wondering, whether we will be seeing any zombies in the experience, and according to Alpert, “we are not ruling anything out.” I don’t know about you, but the idea of Walking Dead shorts in VR, or even some epic zombie short in VR, sounds amazing. But even if there aren’t any zombies in the series, it should be something amazing seeing as it is coming from Alpert and Skybound Entertainment.",
        "Also of major interest is the promise of NBA content, which Baxter says will be “a mix of game action and behind the scenes footage from marquee events.” This could be the mainstream game changer that is needed to bring VR to the non-tech enthusiast crowd. For sports fans, like myself, this is an incredible new way to see the NBA, allowing you to sit courtside and actually feel like you are there, without having to pay ridiculously high courtside prices. It brings a level of immersion to the sports world that has thus far been unavailable, allowing you to combine the wonderful benefits of feeling like you are at the game with the broadcast benefits, such as commentary.",
        "Beyond the NBA and the new series from Skybound, there will also be experiences coming from Acura, Artist’s Den, Boiler Room, Matador, Mountain Dew, Red Bull, and Refinery 29. It’s an impressive list of launch content and I for one am really excited to check it all out. The fact that they are promising new daily content is beyond awesome, and will really help to push VR into the mainstream."
      ]
    },

     {
      "title": "The Last Hurdles: The Remaining Challenges for Consumer Virtual Reality (Part 2)",
      "author": "Will Mason",
      "date": "01/02/15",
      "paragraphs": [
      "INPUT DEVICES",
      "As a VR developer, the biggest problem I face currently is input devices.  Many VR applications use gamepads or keyboard and mouse for controls, but these devices are inadequate for VR.  You need to be able to use your hands in VR to truly feel a sense of presence.  The problem lies in the fact that different applications require different types of interactions, and there is not any single device that is perfect for all of them.  Devices such as the Leap Motion use a depth camera to track the position of your hands.  This works well for applications that require simple gestures and just need the position of your hands.  Historically, the glove is one of the primary input devices used in VR.  Control VR is a glove system being developed for the consumer VR market.  Gloves are perfect for applications that involve manipulating and grasping objects with your hands.  Games, especially first person shooters, call for a different type of interaction since not only do these games need the position of your hands but they also require you to press buttons to shoot your gun or open a menu.  Currently it is unlikely that you own an Omni, so you will also need joysticks to move your character in the game world.  For these games a controller like the STEM system from Sixense works best.  The STEM system features two controllers that you hold that track the position of your hands.  Each controller is wireless and features joysticks and buttons, making it the perfect controller for games and some other applications.",
      "Most of the controllers that have been created for consumer VR are not in the hands of most VR enthusiasts, let alone your average consumer or even gamer.  This makes it very difficult for developers to build applications that take full advantage of VR since most of their target audience does not own the required input devices.  As Palmer Luckey stated at the SVVR Conference and Expo in May 2013, there are no standards for input devices yet.  It looks like there will not be any time soon.  Oculus acquired the Carbon Design Group in 2014 so most likely they will be producing their own input device.  If Oculus decides to ship a motion-tracking controller with their first consumer Rift, that will at least give developers a standard, but until then input remains a significant problem (and it likely still will be even if Oculus ships a controller).",
      "HAPTICS",
      "This is probably the hardest problem listed in this article.  When you reach out and touch a wall in a VR world, you want to be able to feel that wall.  Clearly the hardware to support that level of feedback will not be available any time soon.  The name for this technology is called haptics.  It is the technology that allows you to feel tactile feedback from the virtual environment.  Games have historically used simple mechanisms to provide crude haptic feedback, such as “rumble packs.”  Fortunately it is possible to create spectacular VR experiences without haptic feedback.  While haptics would greatly improve VR, the lack of haptics is not a roadblock to the success of consumer VR.",
      "HMD WEIGHT",
      "An HMD that is too heavy is sure to reduce the user’s sense of presence in the environment.  It is difficult to forget that you are wearing something on your head when it feels like a dumbbell is strapped to your forehead.  Most high-quality noise canceling head phones add even more weight to your head (not to mention wires which I will address in the next section).  The Oculus DK2 weighs 0.97 lbs which is slightly heavier than the DK1 which weighed roughly 0.83 lbs.  The DK2 is too heavy, but fortunately Oculus has proven that they can significantly reduce the weight of the HMD with their latest prototype, Crescent Bay.  While I do not have the exact weight of the Crescent Bay, I have tried it and can assure you that it weighs much less.  It also includes built-in headphones so you do not have to further burden your head with more weight.  The Crescent Bay proves that HMD weight is a solvable problem, and we can look forward to lightweight consumer VR hardware.",
      "WIRES",
      "Nothing zaps you out of an immersive VR experience like the feeling of a wire snagging the corner of your desk, or getting tangled in the wheels of your office chair.  Desktop VR in its current state is a mess of wires.   Mobile VR devices like the GearVR circumvent this problem, but have less processing power than a gaming desktop and currently do not have native support for positional tracking.  The question remains, will the Oculus Rift CV1 be untethered?  I think the answer is most likely no.  That does not mean that the CV1 will be a bad experience.  It will be spectacular.  However, before it can reach perfection, wires are one more obstacle that consumer VR hardware must overcome without sacrificing other features like positional tracking.",
      "FIELD OF VIEW",
      "When you wear the Oculus Rift (any of the prototypes so far), you will notice that you can see the parts of the HMD to the sides of the lenses.  This is because the field of view of the device is less than that of your eyes.  Field of view is how much of the virtual world you can see at once, and is measured as an angle.  The Oculus DK2 has a field of view of about 100 degrees, compared to the field of view of the average human which is nearly 180 degrees.  While VR is still fascinating with a limited field of view, to achieve full immersion the field of view of consumer HMDs will have to be improved.  Unfortunately this is not a simple task, as Palmer Luckey, the founder of Oculus, stated on the Reddit forums: “The challenges of creating high FOV HMDs have been known to VR professionals for a long time, most of the problems have not changed.”",
      "RESOLUTION/SCREEN DOOR EFFECT",
      "Since the Oculus Rift Kickstarter ignited the consumer VR spark in 2012, the resolution of consumer VR HMDs has significantly improved.  The Oculus Rift DK1 had a resolution of 1280 x 800 (640 x 800 for each eye).  The pixelated display reminded me of the first time I played Quake for DOS in 1996.  For me this added to the charm of the device, but clearly higher resolution was desired.  The display also suffered from what is known as the “screen door effect,” which causes black space between pixels to be noticeable to the user (this is exacerbated by the fact that a lens is magnifying the screen). The Oculus Rift DK2 resolution is substantially higher at 1920 x 1080.  Even at this resolution, I have heard many casual users complain that the screen looks “blurry,” and the screen door effect is still apparent.  Luckily the resolution of the Crescent Bay prototype is outstanding and the screen door effect is reduced, and the recently-released Samsung GearVR has a resolution of 2560×1440 which is sufficient for consumer VR.  Screen resolution and the screen door effect will be solved problems for consumer VR.",
      "COST",
      "VR is pricey.  Consumer VR hardware is substantially cheaper than the VR hardware that has been historically used by research institutions, but it is still expensive.  Currently even a basic VR setup can run at least $2,000.  This cost includes a desktop or laptop with a high end graphics card, and an Oculus Rift DK2 ($350).  Also, some type of motion-tracking input device is a requirement if you want a more complete VR experience and that could cost an additional few hundred dollars.  The Samsung GearVR is powered by the Galaxy Note 4 phone so it does not require a desktop or laptop.  However, the Note 4 phone is $800 unless your mobile provider subsidizes it in which case it will cost around $300.  The GearVR itself costs $200, so the total cost of a gear VR setup is $500 – $1100, and you would probably want to throw in an Android gamepad as well.  There are lower-cost mobile VR options like Google Cardboard.  They may be fun, but they do not deliver anywhere near the same level of immersion as the Rift or the GearVR.",
      "Currently the VR market is fragmented and littered with peripherals being manufactured by different companies (most of them are kickstarter-funded projects that have not even shipped yet).  These devices include the motion-tracking input devices like the STEM system from Sixense, treadmills for locomotion like the Virtuix Omni, haptic vests like the KOR-FX gaming vest.  We can also expect additional devices to arise that simulate other aspects of reality.  I am waiting for someone to try to market a smell generator.  I doubt it will fly as a consumer product, but I would not be surprised if we see one in the next few years.",
      "If you want to set up a full consumer VR experience you have to buy several pieces of expensive hardware from different manufacturers.  Currently that limits the full experience consumer VR to die-hard enthusiasts.  Still, I have known gamers to spend absurd amounts of money on hardware such as graphics cards in the past.  That leads me to believe there is a contingency of gamers that will splurge on VR (or their parents will do it for them).  Outside of gaming, VR is being hyped for a plethora of applications such as social interaction, education, and enterprise.  For VR to succeed in all of these areas the hardware must be affordable to more casual users.  Fortunately not all of the fancy peripherals are required for most users, but even the basic HMD and computer hardware are too expensive right now.  When this hardware reaches the mass market the costs will gradually be reduced, but by how much and how soon remains to be seen.",
      "CONCLUSION",
      "Despite aforementioned problems, VR will be successful as a consumer product.  The bottom line is that even though we cannot achieve a perfect VR experience for consumers right now, they are still fascinated by the current hardware and software.  VR suffers each of the weaknesses I mentioned in this article.  Some of those problems will be solved when VR hits consumers such as latency, resolution, HMD weight, and positional tracking.  Others such as haptics and locomotion will linger for years, but neither of these are showstoppers.  The Oculus Crescent Bay prototype gives a glimpse into what consumer VR will be like, and it is far beyond what we have now.  I am devoting my life to VR for what it will be not for what it is, but it’s pretty damn good right now."




      ]
    }
  ]
}