{
  "posts": [


      {
      "title": "The Omni belongs in the gym, not the living room",
      "author": "Will Mason",
      "date": "01/10/2015",
      "paragraphs": [
        "There was a lot of hype surrounding the debut of the Virtuix Omni at this year’s International CES.",
        "Ever since the company premiered on Kickstarter, there has been a portion of the VR community who have questioned its potential for success.",
        "There are a number of reasons for this, it’s large, weighing in at about 160lbs, with a footprint of 47”x42”x27” meaning that if you don’t have a room dedicated to it, one might run into issues with space. Secondly, many have pointed out that you need to hang the Rift cables from the ceiling, to prevent you from tripping all over yourself. Both of these are issues that make this device not one that is suited for the mass gaming market… and that is totally ok.The Omni is a fantastic device. It is smooth and accurate, as well as entertaining, but Jan – the CEO of Virtiux, himself admits “it’s not for everybody.” Where it does fit, however, is as a “home exercise device,” a product category that is obviously quite successful. So, changing one’s perspective on the use cases for this product, it can be easy to see why the Omni could help revolutionize the way we run at home.",
        "Currently, the Omni is available for pre-order for $499, which is 55% cheaper than the cost of your average treadmill. Combine that with your Oculus and the cost is pretty comparable, and is certainly cheaper than your higher end treadmill models, which run closer to $1500. Meaning the Omni/Rift combo will run about 2/3rds of the cost of a well appointed treadmill, as well as coming with a number of additional benefits. It’s quite the trip being able to run and gun in a virtual world while actually running. Running through the demo for five minutes or so, I worked up a bit of a sweat and needed to towel off. I found that I was so immersed in the experience that I didn’t even notice I was working out until I took off the Rift. For people who love to run distances, this could be a big boon. Watching SportsCenter in a home gym can only entertain you for so long, a game gives you constant stimulation, which really enhances the exercise experience and pushes you to keep going.",
        "Beyond gamifying the running experience, the Omni actually improves the running experience physically as well; especially when compared to a traditional treadmill. I say this for a couple of reasons, first traditional treadmills have you running with the belt, this provides an additional amount of force that isn’t present in a traditional running setting. This is why when you run on a treadmill you might be able to run faster than you can when you go for a run around the block, especially at distances over two miles.",
        "Second, traditional treadmills can often lead to joint pain, especially in those who do not exercise on them often (which can lead to people exercising less because they then associate that pain with exercise and seek to avoid it). According to Livestrong.com, this is because “exercising on treadmills offers different approaches to joint biomechanics than walking or running on a track, issues with joint pain from treadmills are frequently encountered by both first-time and long-time users of treadmills.” Simply put, you run differently on a treadmill than you do on a track or sidewalk and it stresses your muscles and joints. With the Omni, there is very low resistance, the surface is extremely slick, especially with the specialty shoes for the system. This presents one with a slight learning curve, as I found out when I about ate shit trying to get in for the first time, but once I got the hang of it I found running in the device to be quite comfortable. It almost feels like running on air when you are in the Rift, the feeling is very hard to grasp at the start; that being said it was something I felt I could continue to run in for much longer than I would run on a traditional treadmill.",
        "A third advantage the treadmill has is the new sensors, which are attached to the laces of the shoes, allowing for your motions to be tracked even while you are not touching the surface of the device. This opens the door for potential light plyometrics to be added into one’s workout within the device. And with as much wearable fitness tech as I saw on the show floor at CES, it will be interesting to see if any integration with that sort of technology becomes a part of the Omni’s plan.",
        "This all being said, there still is a problem that remains in that the Rift has a tendency to get a bit gross with sweat and can occasionally fog up. This however seems like a solvable problem. We have seen covers like Eric Greenbaum’s About Face and the fogging issue is not too different than a fogging issue while running with regular glasses. It is an inconvenience but not one that is a game-breaker and is certainly an inconvenience that is more than balanced out by the experience of exercising and gaming simultaneously. Additionally, if you use an anti-fogging spray, similar to the ones used for scuba diving, it can help alleviate any fogging issues within the Rift.",
        "So, rather than thinking of the Omni as an oversized, pricey piece of input hardware for gaming, it is more helpful to view it as a device specifically for the home exercise market, and one that is quite competitive in both price and size. The global treadmill market is a huge one, with over $1.12 billion in sales in 2011. If Omni positions itself in this segment, they could become a big player in the field once consumer VR takes off."
      ]
    },

    {
      "title": "Oovoo plans to bring their 120 million users to VR, exclusive report",
      "author": "Will Mason",
      "date": "01/08/15",
      "paragraphs": [
        "Oovoo, one of the leading social media companies in the world, is getting into the VR space, according to JP Nauseef the company’s managing director. In an exclusive interview with Upload, Nauseef and CMO Chris Wire revealed the company has plans to integrate its platform with Oculus VR.",
        "“The universe of possibilities is virtually endless,” said Nauseef, “we are picking the applications very carefully but integration with Oculus is one of those.” When pressed for further details Nauseef remained coy, “we want to save some surprises for later.” However, he promised that further announcements in the next two quarters and hinted at the mobile world conference and Barcelona being the place where the platform will be revealed. “This is the year, it’s going to be exciting.”",
        "This is all obviously extremely exciting for VR as it has the potential to be a revolutionary social platform. With 120 million registered users Oovoo is one of Skype’s top competitors and is one of the top social media apps in the world. The potential of this marriage is obvious as it would expose the massive, established user base to virtual reality.",
        "This news all comes at the same time as Oovoo announced its intelligent video platform powered by  FaceShift technology. At the booth the company was demoing this new tech in an impressive way, stay tuned for that video later."
      ]
    },

     {
      "title": "Oculus shows off the Crescent Bay at CES 2015, and it’s better than you can imagine",
      "author": "Will Mason",
      "date": "01/06/15",
      "paragraphs": [
        "The International CES is now officially underway, so of course I woke up early and made a bee-line for the Oculus booth, which is thoroughly impressive in and of itself. A two story well appointed behemoth, it’s clear that Oculus is a centerpiece at this year’s CES. But enough about the booth, lets get right to the thing we have all been so excited to see, the new Crescent Bay.",
        "This was my first time getting the chance to try on the new prototype, which many are speculating is the last version before CV1, so I was obviously super pumped to try it on and I will tell you right now, I hadn’t even prepared myself for the level of epicness that I witnessed within the demo. It was seriously that good, and if there are any skeptics still out there, be ready to have your skepticism completely washed away.",
        "I walked into the soundproofed booth and the first thing I noticed was the lack of any chairs in the room, right away they wanted to make sure this was a standing experience. My demo leader asked me a couple of questions and took my glasses then prepared to hand me the most life changing piece of hardware I have ever had the pleasure of trying. After a brief adjustment or two the first demo fired up but not before I was told five words that would utterly transform the VR experience for me, “go ahead and walk around.”",
        "The first demo placed me in a futuristic looking boiler room, as I walked around I found quickly that the padded walls provided more than just excellent sound proofing. The positional tracking on the Crescent Bay is massively improved over the DK2 and it really showed during this demo, true to what I was told, I was able to maneuver rather freely within the environment. How’s the display, you ask? Un-be-fucking-leavable. Seriously, this thing was so crisp and clear that in the 10-15 minutes (it was so immersive I completely lost track of time) of demos I tried it provoked more audible “Holy shit’s!” than the South Park episode with the shit counter. Seriously, I think the demoer was enjoying watching me as much as I was enjoying demoing, but I digress.",
        "The Crescent Bay has completely solved the screen door effect that plagued the DK1 and to a lesser degree the DK2. The display was also far more crisp than the DK2, I have found that with my eyesight sometimes in the DK2 objects would occasionally appear fairly blurry, this was definitely not the case with the Crescent Bay. None of the demoes that I tried really had any text in them, so I can’t comment yet on the readability of it, however there was one of the demoes that had some sheet music on a stand that I walked over and leaned in on and it looked crystal clear up close, although before I approached it, it did appear slightly pixelated, but I think that may have been a rendering glitch.",
        "Each of the 18 demos that I was ran through showed off a different aspect of the technology and how it could be applied across multiple genres and mediums. While there was no 360-degree video demo per se, there was a hilarious demo with two robot arms that got into a fight with magic wands, it was very reminiscent of the original Pixar lamp short. The demo really showed off the narrative power of videos in VR as the fight commenced and the robots shifted to either side of the peripheral vision firing colorful, Harry Potter-esque bolts of magic at each other. As I shifted directions to track the bolts I found myself physically reacting and dodging them as they came towards my face, it was one of the first times I have had a truly subconscious physical reaction to VR and was definitely one of my first moments of true presence. There was a similar effect achieved for me during the bullet time demo, Showdown – which was shown at Connect last year – as the 3D was so great that I really felt like I was moving in slow motion through a firefight with a giant robot, I took the opportunity to practice my Matrix moves as I dipped and dodged to avoid the bullets and shrapnel.",
        "Speaking of the 3D, I am not sure what it was, perhaps just optimization of the experiences, but it felt massively improved over the DK2. This was especially true during the two demos that I tried that involved a T-Rex. The first was simply a highly detailed model that growled at you as you looked around it, but at that scale the sense of depth was truly impressive. The second placed me in a hallway, as I looked around I could sense something was about to happen and when it did… whoa nelly. A loud roar, heard incredibly clearly though the surprisingly impressive built in headphones, caused me to whip around to see a T-Rex bum rushing me, and as it got close and opened its mouth to take a bite, I felt myself putting my hands up, the only thing was missing was foul breath in my face but I can live without that.",
        "Another demo placed me in a familiar top of the being built skyscraper situation, but this one was far more clear than any other I have tried. One of the more hilarious highlights of this particular demo was a billboard featuring Palmer himself placed directly behind the player in the futuristic cityscape. My one gripe, and it’s minor, is that I was a little disappointed I didn’t go careening down to the concrete below when I stepped off the edge, although I did get a little bit of a weird feeling in the pit of my stomach as I peered down. Unlike the Sightline demo, this scene was at night, which really added to the beauty of the city scene, as the colors of the lights really popped.",
        "Speaking of colors perhaps the best demo for that was this one that was similar to the art style of Windracers. All it was was you sitting around a fire with a couple of cute forest animals, and it was extremely simple graphically but the colors all popped quite well. It did an excellent job of demonstrating how you don’t need the most photorealistic graphics to create an immersive and enjoyable scene.",
        "By the end of the last demo, my cheeks hurt because I had been smiling so much in pure amazement and joy from the experience. It reminded me of the first time I tried VR, firing up a Titans of Space demo and sheading a tear out of pure amazement that this, something I had dreamed of my entire life, was actually going to be realized. Simply put, the Crescent Bay was like experiencing VR for the first time all over again.",
        "Make sure to stay tuned to Upload’s coverage of CES, we will be bringing a 180-degree 3D camera out on the show floor, thanks to our friends over at Lucid Cam, so we should have some pretty great content to show all of you soon. Until then, stay Rifty."
      ]
    }
  ]
}