{
  "post": {
    "title": "THE OMNI BELONGS IN THE GYM, NOT THE LIVING ROOM",
    "body": "There was a lot of hype surrounding the debut of the Virtuix Omni at this year’s International CES. Ever since the company premiered on Kickstarter, there has been a portion of the VR community who have questioned its potential for success. There are a number of reasons for this, it’s large, weighing in at about 160lbs, with a footprint of 47”x42”x27” meaning that if you don’t have a room dedicated to it, one might run into issues with space. Secondly, many have pointed out that you need to hang the Rift cables from the ceiling, to prevent you from tripping all over yourself. Both of these are issues that make this device not one that is suited for the mass gaming market… and that is totally ok.The Omni is a fantastic device. It is smooth and accurate, as well as entertaining, but Jan – the CEO of Virtiux, himself admits “it’s not for everybody.” Where it does fit, however, is as a “home exercise device,” a product category that is obviously quite successful. So, changing one’s perspective on the use cases for this product, it can be easy to see why the Omni could help revolutionize the way we run at home. Currently, the Omni is available for pre-order for $499, which is 55% cheaper than the cost of your average treadmill. Combine that with your Oculus and the cost is pretty comparable, and is certainly cheaper than your higher end treadmill models, which run closer to $1500. Meaning the Omni/Rift combo will run about 2/3rds of the cost of a well appointed treadmill, as well as coming with a number of additional benefits. It’s quite the trip being able to run and gun in a virtual world while actually running. Running through the demo for five minutes or so, I worked up a bit of a sweat and needed to towel off. I found that I was so immersed in the experience that I didn’t even notice I was working out until I took off the Rift. For people who love to run distances, this could be a big boon. Watching SportsCenter in a home gym can only entertain you for so long, a game gives you constant stimulation, which really enhances the exercise experience and pushes you to keep going."   
  }
}